0xsmirk/mcu_cmsis_svd/Spansion/MB9BF56xx.svd
        <!-- REGISTER "ICU_ICFS32" -->
        <register derivedFrom="ICU_ICFS10">
          <name>ICU_ICFS32</name>
          <description> register ICU_ICFS32 </description>
          <addressOffset>0x16D</addressOffset>
        </register>
        <!-- REGISTER "ICU_ICCP0" -->
        <register>
          <name>ICU_ICCP0</name>
          <description> register ICU_ICCP0 </description>
          <addressOffset>0x176</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x0000</resetMask>
        </register>
        <!-- REGISTER "ICU_ICCP1" -->
        <register derivedFrom="ICU_ICCP0">
          <name>ICU_ICCP1</name>
          <description> register ICU_ICCP1 </description>
          <addressOffset>0x17A</addressOffset>
        </register>
        <!-- REGISTER "ICU_ICCP2" -->
        <register derivedFrom="ICU_ICCP0">
          <name>ICU_ICCP2</name>
          <description> register ICU_ICCP2 </description>
          <addressOffset>0x17E</addressOffset>
        </register>
        <!-- REGISTER "ICU_ICCP3" -->
        <register derivedFrom="ICU_ICCP0">
          <name>ICU_ICCP3</name>
          <description> register ICU_ICCP3 </description>
          <addressOffset>0x182</addressOffset>
        </register>
        <!-- REGISTER "ICU_ICSA10" -->
        <register>
          <name>ICU_ICSA10</name>
          <description> register ICU_ICSA10 </description>
          <addressOffset>0x184</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EG0" -->
            <field>
              <name>EG0</name>
              <description> bitfield EG0 </description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EG1" -->
            <field>
              <name>EG1</name>
              <description> bitfield EG1 </description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ICE0" -->
            <field>
              <name>ICE0</name>
              <description> bitfield ICE0 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ICE1" -->
            <field>
              <name>ICE1</name>
              <description> bitfield ICE1 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ICP0" -->
            <field>
              <name>ICP0</name>
              <description> bitfield ICP0 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ICP1" -->
            <field>
              <name>ICP1</name>
              <description> bitfield ICP1 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ICU_ICSB10" -->
        <register>
          <name>ICU_ICSB10</name>
          <description> register ICU_ICSB10 </description>
          <addressOffset>0x185</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "IEI0" -->
            <field>
              <name>IEI0</name>
              <description> bitfield IEI0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IEI1" -->
            <field>
              <name>IEI1</name>
              <description> bitfield IEI1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ICU_ICSA32" -->
        <register derivedFrom="ICU_ICSA10">
          <name>ICU_ICSA32</name>
          <description> register ICU_ICSA32 </description>
          <addressOffset>0x188</addressOffset>
        </register>
        <!-- REGISTER "ICU_ICSB32" -->
        <register derivedFrom="ICU_ICSB10">
          <name>ICU_ICSB32</name>
          <description> register ICU_ICSB32 </description>
          <addressOffset>0x189</addressOffset>
        </register>
        <!-- REGISTER "ADCMP_ACFS10" -->
        <register>
          <name>ADCMP_ACFS10</name>
          <description> register ADCMP_ACFS10 </description>
          <addressOffset>0x170</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FSA1" -->
            <field>
              <name>FSA1</name>
              <description> bitfield FSA1 </description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FSA0" -->
            <field>
              <name>FSA0</name>
              <description> bitfield FSA0 </description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ADCMP_ACFS32" -->
        <register derivedFrom="ADCMP_ACFS10">
          <name>ADCMP_ACFS32</name>
          <description> register ADCMP_ACFS32 </description>
          <addressOffset>0x171</addressOffset>
        </register>
        <!-- REGISTER "ADCMP_ACFS54" -->
        <register derivedFrom="ADCMP_ACFS10">
          <name>ADCMP_ACFS54</name>
          <description> register ADCMP_ACFS54 </description>
          <addressOffset>0x172</addressOffset>
        </register>
        <!-- REGISTER "ADCMP_ACMP0" -->
        <register>
          <name>ADCMP_ACMP0</name>
          <description> register ADCMP_ACMP0 </description>
          <addressOffset>0x1BA</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ACMP" -->
            <field>
              <name>ACMP</name>
              <description> bitfield ACMP </description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ADCMP_ACMP1" -->
        <register derivedFrom="ADCMP_ACMP0">
          <name>ADCMP_ACMP1</name>
          <description> register ADCMP_ACMP1 </description>
          <addressOffset>0x1BE</addressOffset>
        </register>
        <!-- REGISTER "ADCMP_ACMP2" -->
        <register derivedFrom="ADCMP_ACMP0">
          <name>ADCMP_ACMP2</name>
          <description> register ADCMP_ACMP2 </description>
          <addressOffset>0x1C2</addressOffset>
        </register>
