0xsmirk/mcu_cmsis_svd/Spansion/MB9BF56xx.svd
        <!-- REGISTER "COMP5" -->
        <register derivedFrom="COMP0">
          <name>COMP5</name>
          <description> register COMP5 </description>
          <addressOffset>0x30</addressOffset>
        </register>
        <!-- REGISTER "COMP7" -->
        <register derivedFrom="COMP2">
          <name>COMP7</name>
          <description> register COMP7 </description>
          <addressOffset>0x34</addressOffset>
        </register>
        <!-- REGISTER "COMP8" -->
        <register derivedFrom="COMP0">
          <name>COMP8</name>
          <description> register COMP8 </description>
          <addressOffset>0x48</addressOffset>
        </register>
        <!-- REGISTER "COMP10" -->
        <register derivedFrom="COMP2">
          <name>COMP10</name>
          <description> register COMP10 </description>
          <addressOffset>0x4C</addressOffset>
        </register>
        <!-- REGISTER "COMP12" -->
        <register derivedFrom="COMP0">
          <name>COMP12</name>
          <description> register COMP12 </description>
          <addressOffset>0x50</addressOffset>
        </register>
        <!-- REGISTER "COMP14" -->
        <register derivedFrom="COMP2">
          <name>COMP14</name>
          <description> register COMP14 </description>
          <addressOffset>0x54</addressOffset>
        </register>
        <!-- REGISTER "TRG" -->
        <register>
          <name>TRG</name>
          <description> register TRG </description>
          <addressOffset>0x100</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PEN15" -->
            <field>
              <name>PEN15</name>
              <description> bitfield PEN15 </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PEN14" -->
            <field>
              <name>PEN14</name>
              <description> bitfield PEN14 </description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PEN13" -->
            <field>
              <name>PEN13</name>
              <description> bitfield PEN13 </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PEN12" -->
            <field>
              <name>PEN12</name>
              <description> bitfield PEN12 </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PEN11" -->
            <field>
              <name>PEN11</name>
              <description> bitfield PEN11 </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PEN10" -->
            <field>
              <name>PEN10</name>
              <description> bitfield PEN10 </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PEN09" -->
            <field>
              <name>PEN09</name>
              <description> bitfield PEN09 </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PEN08" -->
            <field>
              <name>PEN08</name>
              <description> bitfield PEN08 </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PEN07" -->
            <field>
              <name>PEN07</name>
              <description> bitfield PEN07 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PEN06" -->
            <field>
              <name>PEN06</name>
              <description> bitfield PEN06 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PEN05" -->
            <field>
              <name>PEN05</name>
              <description> bitfield PEN05 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PEN04" -->
            <field>
              <name>PEN04</name>
              <description> bitfield PEN04 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PEN03" -->
            <field>
              <name>PEN03</name>
              <description> bitfield PEN03 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PEN02" -->
            <field>
              <name>PEN02</name>
              <description> bitfield PEN02 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PEN01" -->
            <field>
              <name>PEN01</name>
              <description> bitfield PEN01 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PEN00" -->
            <field>
              <name>PEN00</name>
              <description> bitfield PEN00 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TRG1" -->
        <register>
          <name>TRG1</name>
          <description> register TRG1 </description>
          <addressOffset>0x140</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PEN23" -->
            <field>
              <name>PEN23</name>
              <description> bitfield PEN23 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PEN22" -->
            <field>
              <name>PEN22</name>
              <description> bitfield PEN22 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PEN21" -->
            <field>
              <name>PEN21</name>
              <description> bitfield PEN21 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PEN20" -->
            <field>
              <name>PEN20</name>
              <description> bitfield PEN20 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PEN19" -->
            <field>
              <name>PEN19</name>
              <description> bitfield PEN19 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PEN18" -->
            <field>
              <name>PEN18</name>
              <description> bitfield PEN18 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PEN17" -->
            <field>
              <name>PEN17</name>
              <description> bitfield PEN17 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PEN16" -->
            <field>
              <name>PEN16</name>
              <description> bitfield PEN16 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "REVC" -->
        <register>
          <name>REVC</name>
          <description> register REVC </description>
          <addressOffset>0x104</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "REV15" -->
            <field>
              <name>REV15</name>
              <description> bitfield REV15 </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV14" -->
            <field>
              <name>REV14</name>
              <description> bitfield REV14 </description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV13" -->
            <field>
              <name>REV13</name>
              <description> bitfield REV13 </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV12" -->
            <field>
              <name>REV12</name>
              <description> bitfield REV12 </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV11" -->
            <field>
              <name>REV11</name>
              <description> bitfield REV11 </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV10" -->
            <field>
              <name>REV10</name>
              <description> bitfield REV10 </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV09" -->
            <field>
              <name>REV09</name>
              <description> bitfield REV09 </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV08" -->
            <field>
              <name>REV08</name>
              <description> bitfield REV08 </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV07" -->
            <field>
              <name>REV07</name>
              <description> bitfield REV07 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV06" -->
            <field>
              <name>REV06</name>
              <description> bitfield REV06 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV05" -->
            <field>
              <name>REV05</name>
              <description> bitfield REV05 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV04" -->
            <field>
              <name>REV04</name>
              <description> bitfield REV04 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV03" -->
            <field>
              <name>REV03</name>
              <description> bitfield REV03 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV02" -->
            <field>
              <name>REV02</name>
              <description> bitfield REV02 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV01" -->
            <field>
              <name>REV01</name>
              <description> bitfield REV01 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV00" -->
            <field>
              <name>REV00</name>
              <description> bitfield REV00 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
