0xsmirk/mcu_cmsis_svd/Spansion/MB9BF56xx.svd
        <!-- REGISTER "PRLH21" -->
        <register derivedFrom="PRLH0">
          <name>PRLH21</name>
          <description> register PRLH21 </description>
          <addressOffset>0x34D</addressOffset>
        </register>
        <!-- REGISTER "PRLL21" -->
        <register derivedFrom="PRLL0">
          <name>PRLL21</name>
          <description> register PRLL21 </description>
          <addressOffset>0x34C</addressOffset>
        </register>
        <!-- REGISTER "PRLH22" -->
        <register derivedFrom="PRLH0">
          <name>PRLH22</name>
          <description> register PRLH22 </description>
          <addressOffset>0x351</addressOffset>
        </register>
        <!-- REGISTER "PRLL22" -->
        <register derivedFrom="PRLL0">
          <name>PRLL22</name>
          <description> register PRLL22 </description>
          <addressOffset>0x350</addressOffset>
        </register>
        <!-- REGISTER "PRLH23" -->
        <register derivedFrom="PRLH0">
          <name>PRLH23</name>
          <description> register PRLH23 </description>
          <addressOffset>0x355</addressOffset>
        </register>
        <!-- REGISTER "PRLL23" -->
        <register derivedFrom="PRLL0">
          <name>PRLL23</name>
          <description> register PRLL23 </description>
          <addressOffset>0x354</addressOffset>
        </register>
        <!-- REGISTER "GATEC0" -->
        <register>
          <name>GATEC0</name>
          <description> register GATEC0 </description>
          <addressOffset>0x218</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x33</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "STRG2" -->
            <field>
              <name>STRG2</name>
              <description> bitfield STRG2 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EDGE2" -->
            <field>
              <name>EDGE2</name>
              <description> bitfield EDGE2 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STRG0" -->
            <field>
              <name>STRG0</name>
              <description> bitfield STRG0 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EDGE0" -->
            <field>
              <name>EDGE0</name>
              <description> bitfield EDGE0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "GATEC4" -->
        <register>
          <name>GATEC4</name>
          <description> register GATEC4 </description>
          <addressOffset>0x258</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x33</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "STRG6" -->
            <field>
              <name>STRG6</name>
              <description> bitfield STRG6 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EDGE6" -->
            <field>
              <name>EDGE6</name>
              <description> bitfield EDGE6 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STRG4" -->
            <field>
              <name>STRG4</name>
              <description> bitfield STRG4 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EDGE4" -->
            <field>
              <name>EDGE4</name>
              <description> bitfield EDGE4 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "GATEC8" -->
        <register>
          <name>GATEC8</name>
          <description> register GATEC8 </description>
          <addressOffset>0x298</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x33</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "STRG10" -->
            <field>
              <name>STRG10</name>
              <description> bitfield STRG10 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EDGE10" -->
            <field>
              <name>EDGE10</name>
              <description> bitfield EDGE10 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STRG8" -->
            <field>
              <name>STRG8</name>
              <description> bitfield STRG8 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EDGE8" -->
            <field>
              <name>EDGE8</name>
              <description> bitfield EDGE8 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "GATEC12" -->
        <register>
          <name>GATEC12</name>
          <description> register GATEC12 </description>
          <addressOffset>0x2D8</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x33</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "STRG14" -->
            <field>
              <name>STRG14</name>
              <description> bitfield STRG14 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EDGE14" -->
            <field>
              <name>EDGE14</name>
              <description> bitfield EDGE14 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STRG12" -->
            <field>
              <name>STRG12</name>
              <description> bitfield STRG12 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EDGE12" -->
            <field>
              <name>EDGE12</name>
              <description> bitfield EDGE12 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "GATEC16" -->
        <register>
          <name>GATEC16</name>
          <description> register GATEC16 </description>
          <addressOffset>0x318</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x33</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "STRG18" -->
            <field>
              <name>STRG18</name>
              <description> bitfield STRG18 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EDGE18" -->
            <field>
              <name>EDGE18</name>
              <description> bitfield EDGE18 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STRG16" -->
            <field>
              <name>STRG16</name>
              <description> bitfield STRG16 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EDGE16" -->
            <field>
              <name>EDGE16</name>
              <description> bitfield EDGE16 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "GATEC20" -->
        <register>
          <name>GATEC20</name>
          <description> register GATEC20 </description>
          <addressOffset>0x358</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x33</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "STRG22" -->
            <field>
              <name>STRG22</name>
              <description> bitfield STRG22 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EDGE22" -->
            <field>
              <name>EDGE22</name>
              <description> bitfield EDGE22 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STRG20" -->
            <field>
              <name>STRG20</name>
              <description> bitfield STRG20 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EDGE20" -->
            <field>
              <name>EDGE20</name>
              <description> bitfield EDGE20 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IGBTC" -->
        <register>
          <name>IGBTC</name>
          <description> register IGBTC </description>
          <addressOffset>0x380</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "IGATIH" -->
            <field>
              <name>IGATIH</name>
              <description> bitfield IGATIH </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IGNFW" -->
            <field>
              <name>IGNFW</name>
              <description> bitfield IGNFW </description>
              <lsb>4</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IGOSEL" -->
            <field>
              <name>IGOSEL</name>
              <description> bitfield IGOSEL </description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IGTRGLV" -->
            <field>
              <name>IGTRGLV</name>
              <description> bitfield IGTRGLV </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IGBTMD" -->
            <field>
              <name>IGBTMD</name>
              <description> bitfield IGBTMD </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
