0xsmirk/mcu_cmsis_svd/Spansion/MB9BF56xx.svd
        <!-- REGISTER "QPCRR" -->
        <register>
          <name>QPCRR</name>
          <description> register QPCRR </description>
          <addressOffset>0x3E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "QPRC1" -->
    <peripheral derivedFrom="QPRC0">
      <name>QPRC1</name>
      <baseAddress>0x40026040</baseAddress>
      <!-- INTERRUPT "QPRC1" -->
      <interrupt>
        <name>QPRC1</name>
        <value>20</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "QPRC2" -->
    <peripheral derivedFrom="QPRC0">
      <name>QPRC2</name>
      <baseAddress>0x40026080</baseAddress>
      <!-- INTERRUPT "QPRC2" -->
      <interrupt>
        <name>QPRC2</name>
        <value>96</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "QPRC3" -->
    <peripheral derivedFrom="QPRC0">
      <name>QPRC3</name>
      <baseAddress>0x400260C0</baseAddress>
      <!-- INTERRUPT "QPRC3" -->
      <interrupt>
        <name>QPRC3</name>
        <value>97</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "QPRC0_NF" -->
    <peripheral>
      <name>QPRC0_NF</name>
      <description> peripheral QPRC0_NF </description>
      <groupName>QPRC0_NF</groupName>
      <baseAddress>0x40026100</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "NFCTLA" -->
        <register>
          <name>NFCTLA</name>
          <description> register NFCTLA </description>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x37</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "AINMD" -->
            <field>
              <name>AINMD</name>
              <description> bitfield AINMD </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AINLV" -->
            <field>
              <name>AINLV</name>
              <description> bitfield AINLV </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AINNWS" -->
            <field>
              <name>AINNWS</name>
              <description> bitfield AINNWS </description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "NFCTLB" -->
        <register>
          <name>NFCTLB</name>
          <description> register NFCTLB </description>
          <addressOffset>0x4</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x37</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BINMD" -->
            <field>
              <name>BINMD</name>
              <description> bitfield BINMD </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BINLV" -->
            <field>
              <name>BINLV</name>
              <description> bitfield BINLV </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BINNWS" -->
            <field>
              <name>BINNWS</name>
              <description> bitfield BINNWS </description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "NFCTLZ" -->
        <register>
          <name>NFCTLZ</name>
          <description> register NFCTLZ </description>
          <addressOffset>0x8</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x37</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ZINMD" -->
            <field>
              <name>ZINMD</name>
              <description> bitfield ZINMD </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ZINLV" -->
            <field>
              <name>ZINLV</name>
              <description> bitfield ZINLV </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ZINNWS" -->
            <field>
              <name>ZINNWS</name>
              <description> bitfield ZINNWS </description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "QPRC1_NF" -->
    <peripheral derivedFrom="QPRC0_NF">
      <name>QPRC1_NF</name>
      <baseAddress>0x40026110</baseAddress>
    </peripheral>
    <!-- PERIPHERAL "QPRC2_NF" -->
    <peripheral derivedFrom="QPRC0_NF">
      <name>QPRC2_NF</name>
      <baseAddress>0x40026120</baseAddress>
    </peripheral>
    <!-- PERIPHERAL "QPRC3_NF" -->
    <peripheral derivedFrom="QPRC0_NF">
      <name>QPRC3_NF</name>
      <baseAddress>0x40026130</baseAddress>
    </peripheral>
    <!-- PERIPHERAL "ADC0" -->
    <peripheral>
      <name>ADC0</name>
      <description> peripheral ADC0 </description>
      <groupName>ADC0</groupName>
      <baseAddress>0x40027000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x14</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x18</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1C</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x20</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x24</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x26</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x28</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x30</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x34</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x38</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x3C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x44</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x48</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x50</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "ADC0" -->
      <interrupt>
        <name>ADC0</name>
        <value>76</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "ADCR" -->
        <register>
          <name>ADCR</name>
          <description> register ADCR </description>
          <addressOffset>0x1</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xEF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SCIF" -->
            <field>
              <name>SCIF</name>
              <description> bitfield SCIF </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PCIF" -->
            <field>
              <name>PCIF</name>
              <description> bitfield PCIF </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CMPIF" -->
            <field>
              <name>CMPIF</name>
              <description> bitfield CMPIF </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCIE" -->
            <field>
              <name>SCIE</name>
              <description> bitfield SCIE </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PCIE" -->
            <field>
              <name>PCIE</name>
              <description> bitfield PCIE </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CMPIE" -->
            <field>
              <name>CMPIE</name>
              <description> bitfield CMPIE </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OVRIE" -->
            <field>
              <name>OVRIE</name>
              <description> bitfield OVRIE </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ADSR" -->
        <register>
          <name>ADSR</name>
          <description> register ADSR </description>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xC7</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ADSTP" -->
            <field>
              <name>ADSTP</name>
              <description> bitfield ADSTP </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FDAS" -->
            <field>
              <name>FDAS</name>
              <description> bitfield FDAS </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PCNS" -->
            <field>
              <name>PCNS</name>
              <description> bitfield PCNS </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PCS" -->
            <field>
              <name>PCS</name>
              <description> bitfield PCS </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCS" -->
            <field>
              <name>SCS</name>
              <description> bitfield SCS </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SCCR" -->
        <register>
          <name>SCCR</name>
          <description> register SCCR </description>
          <addressOffset>0x9</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x80</resetValue>
          <resetMask>0xF7</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SEMP" -->
            <field>
              <name>SEMP</name>
              <description> bitfield SEMP </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "SFUL" -->
            <field>
              <name>SFUL</name>
              <description> bitfield SFUL </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "SOVR" -->
            <field>
              <name>SOVR</name>
              <description> bitfield SOVR </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SFCLR" -->
            <field>
              <name>SFCLR</name>
              <description> bitfield SFCLR </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RPT" -->
            <field>
              <name>RPT</name>
              <description> bitfield RPT </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SHEN" -->
            <field>
              <name>SHEN</name>
              <description> bitfield SHEN </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SSTR" -->
            <field>
              <name>SSTR</name>
              <description> bitfield SSTR </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SFNS" -->
        <register>
          <name>SFNS</name>
          <description> register SFNS </description>
          <addressOffset>0x8</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SFS" -->
            <field>
              <name>SFS</name>
              <description> bitfield SFS </description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SCFD" -->
        <register>
          <name>SCFD</name>
          <description> register SCFD </description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFF0131F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SD" -->
            <field>
              <name>SD</name>
              <description> bitfield SD </description>
              <lsb>20</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INVL" -->
            <field>
              <name>INVL</name>
              <description> bitfield INVL </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RS" -->
            <field>
              <name>RS</name>
              <description> bitfield RS </description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "SC" -->
            <field>
              <name>SC</name>
              <description> bitfield SC </description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SCIS3" -->
        <register>
          <name>SCIS3</name>
          <description> register SCIS3 </description>
          <addressOffset>0x11</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "AN31" -->
            <field>
              <name>AN31</name>
              <description> bitfield AN31 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN30" -->
            <field>
              <name>AN30</name>
              <description> bitfield AN30 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN29" -->
            <field>
              <name>AN29</name>
              <description> bitfield AN29 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN28" -->
            <field>
              <name>AN28</name>
              <description> bitfield AN28 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN27" -->
            <field>
              <name>AN27</name>
              <description> bitfield AN27 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN26" -->
            <field>
              <name>AN26</name>
              <description> bitfield AN26 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN25" -->
            <field>
              <name>AN25</name>
              <description> bitfield AN25 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN24" -->
            <field>
              <name>AN24</name>
              <description> bitfield AN24 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SCIS2" -->
        <register>
          <name>SCIS2</name>
          <description> register SCIS2 </description>
          <addressOffset>0x10</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "AN23" -->
            <field>
              <name>AN23</name>
              <description> bitfield AN23 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN22" -->
            <field>
              <name>AN22</name>
              <description> bitfield AN22 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN21" -->
            <field>
              <name>AN21</name>
              <description> bitfield AN21 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN20" -->
            <field>
              <name>AN20</name>
              <description> bitfield AN20 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN19" -->
            <field>
              <name>AN19</name>
              <description> bitfield AN19 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN18" -->
            <field>
              <name>AN18</name>
              <description> bitfield AN18 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN17" -->
            <field>
              <name>AN17</name>
              <description> bitfield AN17 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN16" -->
            <field>
              <name>AN16</name>
              <description> bitfield AN16 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
