0xsmirk/mcu_cmsis_svd/Spansion/MB9BF56xx.svd
        <!-- REGISTER "PFR7" -->
        <register>
          <name>PFR7</name>
          <description> register PFR7 </description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0000001F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P74" -->
            <field>
              <name>P74</name>
              <description> bitfield P74 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P73" -->
            <field>
              <name>P73</name>
              <description> bitfield P73 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P72" -->
            <field>
              <name>P72</name>
              <description> bitfield P72 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P71" -->
            <field>
              <name>P71</name>
              <description> bitfield P71 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P70" -->
            <field>
              <name>P70</name>
              <description> bitfield P70 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PFR8" -->
        <register>
          <name>PFR8</name>
          <description> register PFR8 </description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x00000003</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P81" -->
            <field>
              <name>P81</name>
              <description> bitfield P81 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P80" -->
            <field>
              <name>P80</name>
              <description> bitfield P80 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PFRE" -->
        <register>
          <name>PFRE</name>
          <description> register PFRE </description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0000000B</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PE3" -->
            <field>
              <name>PE3</name>
              <description> bitfield PE3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PE2" -->
            <field>
              <name>PE2</name>
              <description> bitfield PE2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PE0" -->
            <field>
              <name>PE0</name>
              <description> bitfield PE0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PCR0" -->
        <register derivedFrom="PFR0">
          <name>PCR0</name>
          <description> register PCR0 </description>
          <addressOffset>0x100</addressOffset>
        </register>
        <!-- REGISTER "PCR1" -->
        <register derivedFrom="PFR1">
          <name>PCR1</name>
          <description> register PCR1 </description>
          <addressOffset>0x104</addressOffset>
        </register>
        <!-- REGISTER "PCR2" -->
        <register derivedFrom="PFR2">
          <name>PCR2</name>
          <description> register PCR2 </description>
          <addressOffset>0x108</addressOffset>
        </register>
        <!-- REGISTER "PCR3" -->
        <register derivedFrom="PFR3">
          <name>PCR3</name>
          <description> register PCR3 </description>
          <addressOffset>0x10C</addressOffset>
        </register>
        <!-- REGISTER "PCR4" -->
        <register derivedFrom="PFR4">
          <name>PCR4</name>
          <description> register PCR4 </description>
          <addressOffset>0x110</addressOffset>
        </register>
        <!-- REGISTER "PCR5" -->
        <register derivedFrom="PFR5">
          <name>PCR5</name>
          <description> register PCR5 </description>
          <addressOffset>0x114</addressOffset>
        </register>
        <!-- REGISTER "PCR6" -->
        <register derivedFrom="PFR6">
          <name>PCR6</name>
          <description> register PCR6 </description>
          <addressOffset>0x118</addressOffset>
        </register>
        <!-- REGISTER "PCR7" -->
        <register derivedFrom="PFR7">
          <name>PCR7</name>
          <description> register PCR7 </description>
          <addressOffset>0x11C</addressOffset>
        </register>
        <!-- REGISTER "PCR8" -->
        <register derivedFrom="PFR8">
          <name>PCR8</name>
          <description> register PCR8 </description>
          <addressOffset>0x120</addressOffset>
        </register>
        <!-- REGISTER "PCRE" -->
        <register derivedFrom="PFRE">
          <name>PCRE</name>
          <description> register PCRE </description>
          <addressOffset>0x138</addressOffset>
        </register>
        <!-- REGISTER "DDR0" -->
        <register>
          <name>DDR0</name>
          <description> register DDR0 </description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P0F" -->
            <field>
              <name>P0F</name>
              <description> bitfield P0F </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P0E" -->
            <field>
              <name>P0E</name>
              <description> bitfield P0E </description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P0D" -->
            <field>
              <name>P0D</name>
              <description> bitfield P0D </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P0C" -->
            <field>
              <name>P0C</name>
              <description> bitfield P0C </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P0B" -->
            <field>
              <name>P0B</name>
              <description> bitfield P0B </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P0A" -->
            <field>
              <name>P0A</name>
              <description> bitfield P0A </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P09" -->
            <field>
              <name>P09</name>
              <description> bitfield P09 </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P08" -->
            <field>
              <name>P08</name>
              <description> bitfield P08 </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P07" -->
            <field>
              <name>P07</name>
              <description> bitfield P07 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P06" -->
            <field>
              <name>P06</name>
              <description> bitfield P06 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P05" -->
            <field>
              <name>P05</name>
              <description> bitfield P05 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P04" -->
            <field>
              <name>P04</name>
              <description> bitfield P04 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P03" -->
            <field>
              <name>P03</name>
              <description> bitfield P03 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P02" -->
            <field>
              <name>P02</name>
              <description> bitfield P02 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P01" -->
            <field>
              <name>P01</name>
              <description> bitfield P01 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P00" -->
            <field>
              <name>P00</name>
              <description> bitfield P00 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DDR1" -->
        <register derivedFrom="PFR1">
          <name>DDR1</name>
          <description> register DDR1 </description>
          <addressOffset>0x204</addressOffset>
        </register>
        <!-- REGISTER "DDR2" -->
        <register derivedFrom="PFR2">
          <name>DDR2</name>
          <description> register DDR2 </description>
          <addressOffset>0x208</addressOffset>
        </register>
        <!-- REGISTER "DDR3" -->
        <register derivedFrom="PFR3">
          <name>DDR3</name>
          <description> register DDR3 </description>
          <addressOffset>0x20C</addressOffset>
        </register>
        <!-- REGISTER "DDR4" -->
        <register derivedFrom="PFR4">
          <name>DDR4</name>
          <description> register DDR4 </description>
          <addressOffset>0x210</addressOffset>
        </register>
        <!-- REGISTER "DDR5" -->
        <register derivedFrom="PFR5">
          <name>DDR5</name>
          <description> register DDR5 </description>
          <addressOffset>0x214</addressOffset>
        </register>
        <!-- REGISTER "DDR6" -->
        <register derivedFrom="PFR6">
          <name>DDR6</name>
          <description> register DDR6 </description>
          <addressOffset>0x218</addressOffset>
        </register>
