0xsmirk/mcu_cmsis_svd/Spansion/MB9BF56xx.svd
        <!-- REGISTER "CSIO_SCSTR2" -->
        <register>
          <name>CSIO_SCSTR2</name>
          <description> register CSIO_SCSTR2 </description>
          <alternateGroup>CSIO</alternateGroup>
          <addressOffset>0x20</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CSDS" -->
            <field>
              <name>CSDS</name>
              <description> bitfield CSDS </description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CSIO_SCSTR3" -->
        <register>
          <name>CSIO_SCSTR3</name>
          <description> register CSIO_SCSTR3 </description>
          <alternateGroup>CSIO</alternateGroup>
          <addressOffset>0x21</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "CSIO_SACSR" -->
        <register>
          <name>CSIO_SACSR</name>
          <description> register CSIO_SACSR </description>
          <alternateGroup>CSIO</alternateGroup>
          <addressOffset>0x24</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x39DF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TBEEN" -->
            <field>
              <name>TBEEN</name>
              <description> bitfield TBEEN </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CSEIE" -->
            <field>
              <name>CSEIE</name>
              <description> bitfield CSEIE </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CSE" -->
            <field>
              <name>CSE</name>
              <description> bitfield CSE </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TINT" -->
            <field>
              <name>TINT</name>
              <description> bitfield TINT </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TINTE" -->
            <field>
              <name>TINTE</name>
              <description> bitfield TINTE </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSYNE" -->
            <field>
              <name>TSYNE</name>
              <description> bitfield TSYNE </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TDIV" -->
            <field>
              <name>TDIV</name>
              <description> bitfield TDIV </description>
              <lsb>1</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TMRE" -->
            <field>
              <name>TMRE</name>
              <description> bitfield TMRE </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CSIO_STMR" -->
        <register>
          <name>CSIO_STMR</name>
          <description> register CSIO_STMR </description>
          <alternateGroup>CSIO</alternateGroup>
          <addressOffset>0x28</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TM" -->
            <field>
              <name>TM</name>
              <description> bitfield TM </description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CSIO_STMCR" -->
        <register>
          <name>CSIO_STMCR</name>
          <description> register CSIO_STMCR </description>
          <alternateGroup>CSIO</alternateGroup>
          <addressOffset>0x2C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TC" -->
            <field>
              <name>TC</name>
              <description> bitfield TC </description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CSIO_SCSCR" -->
        <register>
          <name>CSIO_SCSCR</name>
          <description> register CSIO_SCSCR </description>
          <alternateGroup>CSIO</alternateGroup>
          <addressOffset>0x30</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0020</resetValue>
          <resetMask>0x03E3</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SCAM" -->
            <field>
              <name>SCAM</name>
              <description> bitfield SCAM </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CDIV" -->
            <field>
              <name>CDIV</name>
              <description> bitfield CDIV </description>
              <lsb>6</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CSLVL" -->
            <field>
              <name>CSLVL</name>
              <description> bitfield CSLVL </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CSEN0" -->
            <field>
              <name>CSEN0</name>
              <description> bitfield CSEN0 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CSOE" -->
            <field>
              <name>CSOE</name>
              <description> bitfield CSOE </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
